# Создать список и заполнить его элементами различных типов данных.
from itertools import cycle

#my_list = [1, 4.5, -7, False, {1, 3, 9}, {2: 4, 5: 55, True: 69}, (5, 8, 12), [45, "fuck", True]]

#  Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.

# n = (input("enter index of the list: ")) - 1 вариант

# print(type(my_list[int(n)]))

# for item, value in enumerate(my_list, 1): - 2 вариант

    # print(f"{item}) {value} - {type(value)}")


















